GopalSaraf/Practicals/PSDL/include/proc/pic18f26q71.inc
// Register: DMAnSCNT
#define DMAnSCNT DMAnSCNT
DMAnSCNT                                 equ 00F2h

// Register: DMAnSCNTL
#define DMAnSCNTL DMAnSCNTL
DMAnSCNTL                                equ 00F2h
// bitfield definitions
DMAnSCNTL_SCNT_POSN                      equ 0000h
DMAnSCNTL_SCNT_POSITION                  equ 0000h
DMAnSCNTL_SCNT_SIZE                      equ 0008h
DMAnSCNTL_SCNT_LENGTH                    equ 0008h
DMAnSCNTL_SCNT_MASK                      equ 00FFh
DMAnSCNTL_SCNT0_POSN                     equ 0000h
DMAnSCNTL_SCNT0_POSITION                 equ 0000h
DMAnSCNTL_SCNT0_SIZE                     equ 0001h
DMAnSCNTL_SCNT0_LENGTH                   equ 0001h
DMAnSCNTL_SCNT0_MASK                     equ 0001h
DMAnSCNTL_SCNT1_POSN                     equ 0001h
DMAnSCNTL_SCNT1_POSITION                 equ 0001h
DMAnSCNTL_SCNT1_SIZE                     equ 0001h
DMAnSCNTL_SCNT1_LENGTH                   equ 0001h
DMAnSCNTL_SCNT1_MASK                     equ 0002h
DMAnSCNTL_SCNT2_POSN                     equ 0002h
DMAnSCNTL_SCNT2_POSITION                 equ 0002h
DMAnSCNTL_SCNT2_SIZE                     equ 0001h
DMAnSCNTL_SCNT2_LENGTH                   equ 0001h
DMAnSCNTL_SCNT2_MASK                     equ 0004h
DMAnSCNTL_SCNT3_POSN                     equ 0003h
DMAnSCNTL_SCNT3_POSITION                 equ 0003h
DMAnSCNTL_SCNT3_SIZE                     equ 0001h
DMAnSCNTL_SCNT3_LENGTH                   equ 0001h
DMAnSCNTL_SCNT3_MASK                     equ 0008h
DMAnSCNTL_SCNT4_POSN                     equ 0004h
DMAnSCNTL_SCNT4_POSITION                 equ 0004h
DMAnSCNTL_SCNT4_SIZE                     equ 0001h
DMAnSCNTL_SCNT4_LENGTH                   equ 0001h
DMAnSCNTL_SCNT4_MASK                     equ 0010h
DMAnSCNTL_SCNT5_POSN                     equ 0005h
DMAnSCNTL_SCNT5_POSITION                 equ 0005h
DMAnSCNTL_SCNT5_SIZE                     equ 0001h
DMAnSCNTL_SCNT5_LENGTH                   equ 0001h
DMAnSCNTL_SCNT5_MASK                     equ 0020h
DMAnSCNTL_SCNT6_POSN                     equ 0006h
DMAnSCNTL_SCNT6_POSITION                 equ 0006h
DMAnSCNTL_SCNT6_SIZE                     equ 0001h
DMAnSCNTL_SCNT6_LENGTH                   equ 0001h
DMAnSCNTL_SCNT6_MASK                     equ 0040h
DMAnSCNTL_SCNT7_POSN                     equ 0007h
DMAnSCNTL_SCNT7_POSITION                 equ 0007h
DMAnSCNTL_SCNT7_SIZE                     equ 0001h
DMAnSCNTL_SCNT7_LENGTH                   equ 0001h
DMAnSCNTL_SCNT7_MASK                     equ 0080h

// Register: DMAnSCNTH
#define DMAnSCNTH DMAnSCNTH
DMAnSCNTH                                equ 00F3h
// bitfield definitions
DMAnSCNTH_SCNT_POSN                      equ 0000h
DMAnSCNTH_SCNT_POSITION                  equ 0000h
DMAnSCNTH_SCNT_SIZE                      equ 0008h
DMAnSCNTH_SCNT_LENGTH                    equ 0008h
DMAnSCNTH_SCNT_MASK                      equ 00FFh
DMAnSCNTH_SCNT8_POSN                     equ 0000h
DMAnSCNTH_SCNT8_POSITION                 equ 0000h
DMAnSCNTH_SCNT8_SIZE                     equ 0001h
DMAnSCNTH_SCNT8_LENGTH                   equ 0001h
DMAnSCNTH_SCNT8_MASK                     equ 0001h
DMAnSCNTH_SCNT9_POSN                     equ 0001h
DMAnSCNTH_SCNT9_POSITION                 equ 0001h
DMAnSCNTH_SCNT9_SIZE                     equ 0001h
DMAnSCNTH_SCNT9_LENGTH                   equ 0001h
DMAnSCNTH_SCNT9_MASK                     equ 0002h
DMAnSCNTH_SCNT10_POSN                    equ 0002h
DMAnSCNTH_SCNT10_POSITION                equ 0002h
DMAnSCNTH_SCNT10_SIZE                    equ 0001h
DMAnSCNTH_SCNT10_LENGTH                  equ 0001h
DMAnSCNTH_SCNT10_MASK                    equ 0004h
DMAnSCNTH_SCNT11_POSN                    equ 0003h
DMAnSCNTH_SCNT11_POSITION                equ 0003h
DMAnSCNTH_SCNT11_SIZE                    equ 0001h
DMAnSCNTH_SCNT11_LENGTH                  equ 0001h
DMAnSCNTH_SCNT11_MASK                    equ 0008h

// Register: DMAnSPTR
#define DMAnSPTR DMAnSPTR
DMAnSPTR                                 equ 00F4h

// Register: DMAnSPTRL
#define DMAnSPTRL DMAnSPTRL
DMAnSPTRL                                equ 00F4h
// bitfield definitions
DMAnSPTRL_SPTR_POSN                      equ 0000h
DMAnSPTRL_SPTR_POSITION                  equ 0000h
DMAnSPTRL_SPTR_SIZE                      equ 0008h
DMAnSPTRL_SPTR_LENGTH                    equ 0008h
DMAnSPTRL_SPTR_MASK                      equ 00FFh
DMAnSPTRL_SPTR0_POSN                     equ 0000h
DMAnSPTRL_SPTR0_POSITION                 equ 0000h
DMAnSPTRL_SPTR0_SIZE                     equ 0001h
DMAnSPTRL_SPTR0_LENGTH                   equ 0001h
DMAnSPTRL_SPTR0_MASK                     equ 0001h
DMAnSPTRL_SPTR1_POSN                     equ 0001h
DMAnSPTRL_SPTR1_POSITION                 equ 0001h
DMAnSPTRL_SPTR1_SIZE                     equ 0001h
DMAnSPTRL_SPTR1_LENGTH                   equ 0001h
DMAnSPTRL_SPTR1_MASK                     equ 0002h
DMAnSPTRL_SPTR2_POSN                     equ 0002h
DMAnSPTRL_SPTR2_POSITION                 equ 0002h
DMAnSPTRL_SPTR2_SIZE                     equ 0001h
DMAnSPTRL_SPTR2_LENGTH                   equ 0001h
DMAnSPTRL_SPTR2_MASK                     equ 0004h
DMAnSPTRL_SPTR3_POSN                     equ 0003h
DMAnSPTRL_SPTR3_POSITION                 equ 0003h
DMAnSPTRL_SPTR3_SIZE                     equ 0001h
DMAnSPTRL_SPTR3_LENGTH                   equ 0001h
DMAnSPTRL_SPTR3_MASK                     equ 0008h
DMAnSPTRL_SPTR4_POSN                     equ 0004h
DMAnSPTRL_SPTR4_POSITION                 equ 0004h
DMAnSPTRL_SPTR4_SIZE                     equ 0001h
DMAnSPTRL_SPTR4_LENGTH                   equ 0001h
DMAnSPTRL_SPTR4_MASK                     equ 0010h
DMAnSPTRL_SPTR5_POSN                     equ 0005h
DMAnSPTRL_SPTR5_POSITION                 equ 0005h
DMAnSPTRL_SPTR5_SIZE                     equ 0001h
DMAnSPTRL_SPTR5_LENGTH                   equ 0001h
DMAnSPTRL_SPTR5_MASK                     equ 0020h
DMAnSPTRL_SPTR6_POSN                     equ 0006h
DMAnSPTRL_SPTR6_POSITION                 equ 0006h
DMAnSPTRL_SPTR6_SIZE                     equ 0001h
DMAnSPTRL_SPTR6_LENGTH                   equ 0001h
DMAnSPTRL_SPTR6_MASK                     equ 0040h
DMAnSPTRL_SPTR7_POSN                     equ 0007h
DMAnSPTRL_SPTR7_POSITION                 equ 0007h
DMAnSPTRL_SPTR7_SIZE                     equ 0001h
DMAnSPTRL_SPTR7_LENGTH                   equ 0001h
DMAnSPTRL_SPTR7_MASK                     equ 0080h

// Register: DMAnSPTRH
#define DMAnSPTRH DMAnSPTRH
DMAnSPTRH                                equ 00F5h
// bitfield definitions
DMAnSPTRH_SPTR_POSN                      equ 0000h
DMAnSPTRH_SPTR_POSITION                  equ 0000h
DMAnSPTRH_SPTR_SIZE                      equ 0008h
DMAnSPTRH_SPTR_LENGTH                    equ 0008h
DMAnSPTRH_SPTR_MASK                      equ 00FFh
DMAnSPTRH_SPTR8_POSN                     equ 0000h
DMAnSPTRH_SPTR8_POSITION                 equ 0000h
DMAnSPTRH_SPTR8_SIZE                     equ 0001h
DMAnSPTRH_SPTR8_LENGTH                   equ 0001h
DMAnSPTRH_SPTR8_MASK                     equ 0001h
DMAnSPTRH_SPTR9_POSN                     equ 0001h
DMAnSPTRH_SPTR9_POSITION                 equ 0001h
DMAnSPTRH_SPTR9_SIZE                     equ 0001h
DMAnSPTRH_SPTR9_LENGTH                   equ 0001h
DMAnSPTRH_SPTR9_MASK                     equ 0002h
DMAnSPTRH_SPTR10_POSN                    equ 0002h
DMAnSPTRH_SPTR10_POSITION                equ 0002h
DMAnSPTRH_SPTR10_SIZE                    equ 0001h
DMAnSPTRH_SPTR10_LENGTH                  equ 0001h
DMAnSPTRH_SPTR10_MASK                    equ 0004h
DMAnSPTRH_SPTR11_POSN                    equ 0003h
DMAnSPTRH_SPTR11_POSITION                equ 0003h
DMAnSPTRH_SPTR11_SIZE                    equ 0001h
DMAnSPTRH_SPTR11_LENGTH                  equ 0001h
DMAnSPTRH_SPTR11_MASK                    equ 0008h
DMAnSPTRH_SPTR12_POSN                    equ 0004h
DMAnSPTRH_SPTR12_POSITION                equ 0004h
DMAnSPTRH_SPTR12_SIZE                    equ 0001h
DMAnSPTRH_SPTR12_LENGTH                  equ 0001h
DMAnSPTRH_SPTR12_MASK                    equ 0010h
DMAnSPTRH_SPTR13_POSN                    equ 0005h
DMAnSPTRH_SPTR13_POSITION                equ 0005h
DMAnSPTRH_SPTR13_SIZE                    equ 0001h
DMAnSPTRH_SPTR13_LENGTH                  equ 0001h
DMAnSPTRH_SPTR13_MASK                    equ 0020h
DMAnSPTRH_SPTR14_POSN                    equ 0006h
DMAnSPTRH_SPTR14_POSITION                equ 0006h
DMAnSPTRH_SPTR14_SIZE                    equ 0001h
DMAnSPTRH_SPTR14_LENGTH                  equ 0001h
DMAnSPTRH_SPTR14_MASK                    equ 0040h
DMAnSPTRH_SPTR15_POSN                    equ 0007h
DMAnSPTRH_SPTR15_POSITION                equ 0007h
DMAnSPTRH_SPTR15_SIZE                    equ 0001h
DMAnSPTRH_SPTR15_LENGTH                  equ 0001h
DMAnSPTRH_SPTR15_MASK                    equ 0080h

// Register: DMAnSPTRU
#define DMAnSPTRU DMAnSPTRU
DMAnSPTRU                                equ 00F6h
// bitfield definitions
DMAnSPTRU_SPTR_POSN                      equ 0000h
DMAnSPTRU_SPTR_POSITION                  equ 0000h
DMAnSPTRU_SPTR_SIZE                      equ 0008h
DMAnSPTRU_SPTR_LENGTH                    equ 0008h
DMAnSPTRU_SPTR_MASK                      equ 00FFh
DMAnSPTRU_SPTR16_POSN                    equ 0000h
DMAnSPTRU_SPTR16_POSITION                equ 0000h
DMAnSPTRU_SPTR16_SIZE                    equ 0001h
DMAnSPTRU_SPTR16_LENGTH                  equ 0001h
DMAnSPTRU_SPTR16_MASK                    equ 0001h
DMAnSPTRU_SPTR17_POSN                    equ 0001h
DMAnSPTRU_SPTR17_POSITION                equ 0001h
DMAnSPTRU_SPTR17_SIZE                    equ 0001h
DMAnSPTRU_SPTR17_LENGTH                  equ 0001h
DMAnSPTRU_SPTR17_MASK                    equ 0002h
DMAnSPTRU_SPTR18_POSN                    equ 0002h
DMAnSPTRU_SPTR18_POSITION                equ 0002h
DMAnSPTRU_SPTR18_SIZE                    equ 0001h
DMAnSPTRU_SPTR18_LENGTH                  equ 0001h
DMAnSPTRU_SPTR18_MASK                    equ 0004h
DMAnSPTRU_SPTR19_POSN                    equ 0003h
DMAnSPTRU_SPTR19_POSITION                equ 0003h
DMAnSPTRU_SPTR19_SIZE                    equ 0001h
DMAnSPTRU_SPTR19_LENGTH                  equ 0001h
DMAnSPTRU_SPTR19_MASK                    equ 0008h
DMAnSPTRU_SPTR20_POSN                    equ 0004h
DMAnSPTRU_SPTR20_POSITION                equ 0004h
DMAnSPTRU_SPTR20_SIZE                    equ 0001h
DMAnSPTRU_SPTR20_LENGTH                  equ 0001h
DMAnSPTRU_SPTR20_MASK                    equ 0010h
DMAnSPTRU_SPTR21_POSN                    equ 0005h
DMAnSPTRU_SPTR21_POSITION                equ 0005h
DMAnSPTRU_SPTR21_SIZE                    equ 0001h
DMAnSPTRU_SPTR21_LENGTH                  equ 0001h
DMAnSPTRU_SPTR21_MASK                    equ 0020h

// Register: DMAnSSZ
#define DMAnSSZ DMAnSSZ
DMAnSSZ                                  equ 00F7h

// Register: DMAnSSZL
#define DMAnSSZL DMAnSSZL
DMAnSSZL                                 equ 00F7h
// bitfield definitions
DMAnSSZL_SSZ_POSN                        equ 0000h
DMAnSSZL_SSZ_POSITION                    equ 0000h
DMAnSSZL_SSZ_SIZE                        equ 0008h
DMAnSSZL_SSZ_LENGTH                      equ 0008h
DMAnSSZL_SSZ_MASK                        equ 00FFh
DMAnSSZL_SSZ0_POSN                       equ 0000h
DMAnSSZL_SSZ0_POSITION                   equ 0000h
DMAnSSZL_SSZ0_SIZE                       equ 0001h
DMAnSSZL_SSZ0_LENGTH                     equ 0001h
DMAnSSZL_SSZ0_MASK                       equ 0001h
DMAnSSZL_SSZ1_POSN                       equ 0001h
DMAnSSZL_SSZ1_POSITION                   equ 0001h
DMAnSSZL_SSZ1_SIZE                       equ 0001h
DMAnSSZL_SSZ1_LENGTH                     equ 0001h
DMAnSSZL_SSZ1_MASK                       equ 0002h
DMAnSSZL_SSZ2_POSN                       equ 0002h
DMAnSSZL_SSZ2_POSITION                   equ 0002h
DMAnSSZL_SSZ2_SIZE                       equ 0001h
DMAnSSZL_SSZ2_LENGTH                     equ 0001h
DMAnSSZL_SSZ2_MASK                       equ 0004h
DMAnSSZL_SSZ3_POSN                       equ 0003h
DMAnSSZL_SSZ3_POSITION                   equ 0003h
DMAnSSZL_SSZ3_SIZE                       equ 0001h
DMAnSSZL_SSZ3_LENGTH                     equ 0001h
DMAnSSZL_SSZ3_MASK                       equ 0008h
DMAnSSZL_SSZ4_POSN                       equ 0004h
DMAnSSZL_SSZ4_POSITION                   equ 0004h
DMAnSSZL_SSZ4_SIZE                       equ 0001h
DMAnSSZL_SSZ4_LENGTH                     equ 0001h
DMAnSSZL_SSZ4_MASK                       equ 0010h
DMAnSSZL_SSZ5_POSN                       equ 0005h
DMAnSSZL_SSZ5_POSITION                   equ 0005h
DMAnSSZL_SSZ5_SIZE                       equ 0001h
DMAnSSZL_SSZ5_LENGTH                     equ 0001h
DMAnSSZL_SSZ5_MASK                       equ 0020h
DMAnSSZL_SSZ6_POSN                       equ 0006h
DMAnSSZL_SSZ6_POSITION                   equ 0006h
DMAnSSZL_SSZ6_SIZE                       equ 0001h
DMAnSSZL_SSZ6_LENGTH                     equ 0001h
DMAnSSZL_SSZ6_MASK                       equ 0040h
DMAnSSZL_SSZ7_POSN                       equ 0007h
DMAnSSZL_SSZ7_POSITION                   equ 0007h
DMAnSSZL_SSZ7_SIZE                       equ 0001h
DMAnSSZL_SSZ7_LENGTH                     equ 0001h
DMAnSSZL_SSZ7_MASK                       equ 0080h

// Register: DMAnSSZH
#define DMAnSSZH DMAnSSZH
DMAnSSZH                                 equ 00F8h
// bitfield definitions
DMAnSSZH_SSZ_POSN                        equ 0000h
DMAnSSZH_SSZ_POSITION                    equ 0000h
DMAnSSZH_SSZ_SIZE                        equ 0008h
DMAnSSZH_SSZ_LENGTH                      equ 0008h
DMAnSSZH_SSZ_MASK                        equ 00FFh
DMAnSSZH_SSZ8_POSN                       equ 0000h
DMAnSSZH_SSZ8_POSITION                   equ 0000h
DMAnSSZH_SSZ8_SIZE                       equ 0001h
DMAnSSZH_SSZ8_LENGTH                     equ 0001h
DMAnSSZH_SSZ8_MASK                       equ 0001h
DMAnSSZH_SSZ9_POSN                       equ 0001h
DMAnSSZH_SSZ9_POSITION                   equ 0001h
DMAnSSZH_SSZ9_SIZE                       equ 0001h
DMAnSSZH_SSZ9_LENGTH                     equ 0001h
DMAnSSZH_SSZ9_MASK                       equ 0002h
DMAnSSZH_SSZ10_POSN                      equ 0002h
DMAnSSZH_SSZ10_POSITION                  equ 0002h
DMAnSSZH_SSZ10_SIZE                      equ 0001h
DMAnSSZH_SSZ10_LENGTH                    equ 0001h
DMAnSSZH_SSZ10_MASK                      equ 0004h
DMAnSSZH_SSZ11_POSN                      equ 0003h
DMAnSSZH_SSZ11_POSITION                  equ 0003h
DMAnSSZH_SSZ11_SIZE                      equ 0001h
DMAnSSZH_SSZ11_LENGTH                    equ 0001h
DMAnSSZH_SSZ11_MASK                      equ 0008h

// Register: DMAnSSA
#define DMAnSSA DMAnSSA
DMAnSSA                                  equ 00F9h

// Register: DMAnSSAL
#define DMAnSSAL DMAnSSAL
DMAnSSAL                                 equ 00F9h
// bitfield definitions
DMAnSSAL_SSA_POSN                        equ 0000h
DMAnSSAL_SSA_POSITION                    equ 0000h
DMAnSSAL_SSA_SIZE                        equ 0008h
DMAnSSAL_SSA_LENGTH                      equ 0008h
DMAnSSAL_SSA_MASK                        equ 00FFh
DMAnSSAL_SSA0_POSN                       equ 0000h
DMAnSSAL_SSA0_POSITION                   equ 0000h
DMAnSSAL_SSA0_SIZE                       equ 0001h
DMAnSSAL_SSA0_LENGTH                     equ 0001h
DMAnSSAL_SSA0_MASK                       equ 0001h
DMAnSSAL_SSA1_POSN                       equ 0001h
DMAnSSAL_SSA1_POSITION                   equ 0001h
DMAnSSAL_SSA1_SIZE                       equ 0001h
DMAnSSAL_SSA1_LENGTH                     equ 0001h
DMAnSSAL_SSA1_MASK                       equ 0002h
DMAnSSAL_SSA2_POSN                       equ 0002h
DMAnSSAL_SSA2_POSITION                   equ 0002h
DMAnSSAL_SSA2_SIZE                       equ 0001h
DMAnSSAL_SSA2_LENGTH                     equ 0001h
DMAnSSAL_SSA2_MASK                       equ 0004h
DMAnSSAL_SSA3_POSN                       equ 0003h
DMAnSSAL_SSA3_POSITION                   equ 0003h
DMAnSSAL_SSA3_SIZE                       equ 0001h
DMAnSSAL_SSA3_LENGTH                     equ 0001h
DMAnSSAL_SSA3_MASK                       equ 0008h
DMAnSSAL_SSA4_POSN                       equ 0004h
DMAnSSAL_SSA4_POSITION                   equ 0004h
DMAnSSAL_SSA4_SIZE                       equ 0001h
DMAnSSAL_SSA4_LENGTH                     equ 0001h
DMAnSSAL_SSA4_MASK                       equ 0010h
DMAnSSAL_SSA5_POSN                       equ 0005h
DMAnSSAL_SSA5_POSITION                   equ 0005h
DMAnSSAL_SSA5_SIZE                       equ 0001h
DMAnSSAL_SSA5_LENGTH                     equ 0001h
DMAnSSAL_SSA5_MASK                       equ 0020h
DMAnSSAL_SSA6_POSN                       equ 0006h
DMAnSSAL_SSA6_POSITION                   equ 0006h
DMAnSSAL_SSA6_SIZE                       equ 0001h
DMAnSSAL_SSA6_LENGTH                     equ 0001h
DMAnSSAL_SSA6_MASK                       equ 0040h
DMAnSSAL_SSA7_POSN                       equ 0007h
DMAnSSAL_SSA7_POSITION                   equ 0007h
DMAnSSAL_SSA7_SIZE                       equ 0001h
DMAnSSAL_SSA7_LENGTH                     equ 0001h
DMAnSSAL_SSA7_MASK                       equ 0080h

