GopalSaraf/Practicals/PSDL/include/proc/pic18f26q71.inc
// Register: OPA2ORS
#define OPA2ORS OPA2ORS
OPA2ORS                                  equ 012Eh
// bitfield definitions
OPA2ORS_ORS_POSN                         equ 0000h
OPA2ORS_ORS_POSITION                     equ 0000h
OPA2ORS_ORS_SIZE                         equ 0008h
OPA2ORS_ORS_LENGTH                       equ 0008h
OPA2ORS_ORS_MASK                         equ 00FFh
OPA2ORS_ORS0_POSN                        equ 0000h
OPA2ORS_ORS0_POSITION                    equ 0000h
OPA2ORS_ORS0_SIZE                        equ 0001h
OPA2ORS_ORS0_LENGTH                      equ 0001h
OPA2ORS_ORS0_MASK                        equ 0001h
OPA2ORS_ORS1_POSN                        equ 0001h
OPA2ORS_ORS1_POSITION                    equ 0001h
OPA2ORS_ORS1_SIZE                        equ 0001h
OPA2ORS_ORS1_LENGTH                      equ 0001h
OPA2ORS_ORS1_MASK                        equ 0002h
OPA2ORS_ORS2_POSN                        equ 0002h
OPA2ORS_ORS2_POSITION                    equ 0002h
OPA2ORS_ORS2_SIZE                        equ 0001h
OPA2ORS_ORS2_LENGTH                      equ 0001h
OPA2ORS_ORS2_MASK                        equ 0004h
OPA2ORS_ORS3_POSN                        equ 0003h
OPA2ORS_ORS3_POSITION                    equ 0003h
OPA2ORS_ORS3_SIZE                        equ 0001h
OPA2ORS_ORS3_LENGTH                      equ 0001h
OPA2ORS_ORS3_MASK                        equ 0008h
OPA2ORS_ORS4_POSN                        equ 0004h
OPA2ORS_ORS4_POSITION                    equ 0004h
OPA2ORS_ORS4_SIZE                        equ 0001h
OPA2ORS_ORS4_LENGTH                      equ 0001h
OPA2ORS_ORS4_MASK                        equ 0010h
OPA2ORS_ORS5_POSN                        equ 0005h
OPA2ORS_ORS5_POSITION                    equ 0005h
OPA2ORS_ORS5_SIZE                        equ 0001h
OPA2ORS_ORS5_LENGTH                      equ 0001h
OPA2ORS_ORS5_MASK                        equ 0020h
OPA2ORS_ORS6_POSN                        equ 0006h
OPA2ORS_ORS6_POSITION                    equ 0006h
OPA2ORS_ORS6_SIZE                        equ 0001h
OPA2ORS_ORS6_LENGTH                      equ 0001h
OPA2ORS_ORS6_MASK                        equ 0040h
OPA2ORS_ORS7_POSN                        equ 0007h
OPA2ORS_ORS7_POSITION                    equ 0007h
OPA2ORS_ORS7_SIZE                        equ 0001h
OPA2ORS_ORS7_LENGTH                      equ 0001h
OPA2ORS_ORS7_MASK                        equ 0080h
OPA2ORS_OPA2ORS_POSN                     equ 0000h
OPA2ORS_OPA2ORS_POSITION                 equ 0000h
OPA2ORS_OPA2ORS_SIZE                     equ 0008h
OPA2ORS_OPA2ORS_LENGTH                   equ 0008h
OPA2ORS_OPA2ORS_MASK                     equ 00FFh
OPA2ORS_OPA2ORS0_POSN                    equ 0000h
OPA2ORS_OPA2ORS0_POSITION                equ 0000h
OPA2ORS_OPA2ORS0_SIZE                    equ 0001h
OPA2ORS_OPA2ORS0_LENGTH                  equ 0001h
OPA2ORS_OPA2ORS0_MASK                    equ 0001h
OPA2ORS_OPA2ORS1_POSN                    equ 0001h
OPA2ORS_OPA2ORS1_POSITION                equ 0001h
OPA2ORS_OPA2ORS1_SIZE                    equ 0001h
OPA2ORS_OPA2ORS1_LENGTH                  equ 0001h
OPA2ORS_OPA2ORS1_MASK                    equ 0002h
OPA2ORS_OPA2ORS2_POSN                    equ 0002h
OPA2ORS_OPA2ORS2_POSITION                equ 0002h
OPA2ORS_OPA2ORS2_SIZE                    equ 0001h
OPA2ORS_OPA2ORS2_LENGTH                  equ 0001h
OPA2ORS_OPA2ORS2_MASK                    equ 0004h
OPA2ORS_OPA2ORS3_POSN                    equ 0003h
OPA2ORS_OPA2ORS3_POSITION                equ 0003h
OPA2ORS_OPA2ORS3_SIZE                    equ 0001h
OPA2ORS_OPA2ORS3_LENGTH                  equ 0001h
OPA2ORS_OPA2ORS3_MASK                    equ 0008h
OPA2ORS_OPA2ORS4_POSN                    equ 0004h
OPA2ORS_OPA2ORS4_POSITION                equ 0004h
OPA2ORS_OPA2ORS4_SIZE                    equ 0001h
OPA2ORS_OPA2ORS4_LENGTH                  equ 0001h
OPA2ORS_OPA2ORS4_MASK                    equ 0010h
OPA2ORS_OPA2ORS5_POSN                    equ 0005h
OPA2ORS_OPA2ORS5_POSITION                equ 0005h
OPA2ORS_OPA2ORS5_SIZE                    equ 0001h
OPA2ORS_OPA2ORS5_LENGTH                  equ 0001h
OPA2ORS_OPA2ORS5_MASK                    equ 0020h
OPA2ORS_OPA2ORS6_POSN                    equ 0006h
OPA2ORS_OPA2ORS6_POSITION                equ 0006h
OPA2ORS_OPA2ORS6_SIZE                    equ 0001h
OPA2ORS_OPA2ORS6_LENGTH                  equ 0001h
OPA2ORS_OPA2ORS6_MASK                    equ 0040h
OPA2ORS_OPA2ORS7_POSN                    equ 0007h
OPA2ORS_OPA2ORS7_POSITION                equ 0007h
OPA2ORS_OPA2ORS7_SIZE                    equ 0001h
OPA2ORS_OPA2ORS7_LENGTH                  equ 0001h
OPA2ORS_OPA2ORS7_MASK                    equ 0080h

// Register: LATA
#define LATA LATA
LATA                                     equ 0140h
// bitfield definitions
LATA_LATA0_POSN                          equ 0000h
LATA_LATA0_POSITION                      equ 0000h
LATA_LATA0_SIZE                          equ 0001h
LATA_LATA0_LENGTH                        equ 0001h
LATA_LATA0_MASK                          equ 0001h
LATA_LATA1_POSN                          equ 0001h
LATA_LATA1_POSITION                      equ 0001h
LATA_LATA1_SIZE                          equ 0001h
LATA_LATA1_LENGTH                        equ 0001h
LATA_LATA1_MASK                          equ 0002h
LATA_LATA2_POSN                          equ 0002h
LATA_LATA2_POSITION                      equ 0002h
LATA_LATA2_SIZE                          equ 0001h
LATA_LATA2_LENGTH                        equ 0001h
LATA_LATA2_MASK                          equ 0004h
LATA_LATA3_POSN                          equ 0003h
LATA_LATA3_POSITION                      equ 0003h
LATA_LATA3_SIZE                          equ 0001h
LATA_LATA3_LENGTH                        equ 0001h
LATA_LATA3_MASK                          equ 0008h
LATA_LATA4_POSN                          equ 0004h
LATA_LATA4_POSITION                      equ 0004h
LATA_LATA4_SIZE                          equ 0001h
LATA_LATA4_LENGTH                        equ 0001h
LATA_LATA4_MASK                          equ 0010h
LATA_LATA5_POSN                          equ 0005h
LATA_LATA5_POSITION                      equ 0005h
LATA_LATA5_SIZE                          equ 0001h
LATA_LATA5_LENGTH                        equ 0001h
LATA_LATA5_MASK                          equ 0020h
LATA_LATA6_POSN                          equ 0006h
LATA_LATA6_POSITION                      equ 0006h
LATA_LATA6_SIZE                          equ 0001h
LATA_LATA6_LENGTH                        equ 0001h
LATA_LATA6_MASK                          equ 0040h
LATA_LATA7_POSN                          equ 0007h
LATA_LATA7_POSITION                      equ 0007h
LATA_LATA7_SIZE                          equ 0001h
LATA_LATA7_LENGTH                        equ 0001h
LATA_LATA7_MASK                          equ 0080h

// Register: LATB
#define LATB LATB
LATB                                     equ 0141h
// bitfield definitions
LATB_LATB0_POSN                          equ 0000h
LATB_LATB0_POSITION                      equ 0000h
LATB_LATB0_SIZE                          equ 0001h
LATB_LATB0_LENGTH                        equ 0001h
LATB_LATB0_MASK                          equ 0001h
LATB_LATB1_POSN                          equ 0001h
LATB_LATB1_POSITION                      equ 0001h
LATB_LATB1_SIZE                          equ 0001h
LATB_LATB1_LENGTH                        equ 0001h
LATB_LATB1_MASK                          equ 0002h
LATB_LATB2_POSN                          equ 0002h
LATB_LATB2_POSITION                      equ 0002h
LATB_LATB2_SIZE                          equ 0001h
LATB_LATB2_LENGTH                        equ 0001h
LATB_LATB2_MASK                          equ 0004h
LATB_LATB3_POSN                          equ 0003h
LATB_LATB3_POSITION                      equ 0003h
LATB_LATB3_SIZE                          equ 0001h
LATB_LATB3_LENGTH                        equ 0001h
LATB_LATB3_MASK                          equ 0008h
LATB_LATB4_POSN                          equ 0004h
LATB_LATB4_POSITION                      equ 0004h
LATB_LATB4_SIZE                          equ 0001h
LATB_LATB4_LENGTH                        equ 0001h
LATB_LATB4_MASK                          equ 0010h
LATB_LATB5_POSN                          equ 0005h
LATB_LATB5_POSITION                      equ 0005h
LATB_LATB5_SIZE                          equ 0001h
LATB_LATB5_LENGTH                        equ 0001h
LATB_LATB5_MASK                          equ 0020h
LATB_LATB6_POSN                          equ 0006h
LATB_LATB6_POSITION                      equ 0006h
LATB_LATB6_SIZE                          equ 0001h
LATB_LATB6_LENGTH                        equ 0001h
LATB_LATB6_MASK                          equ 0040h
LATB_LATB7_POSN                          equ 0007h
LATB_LATB7_POSITION                      equ 0007h
LATB_LATB7_SIZE                          equ 0001h
LATB_LATB7_LENGTH                        equ 0001h
LATB_LATB7_MASK                          equ 0080h

