GopalSaraf/Practicals/PSDL/include/proc/pic18f26q71.inc
// Register: ADCLK
#define ADCLK ADCLK
ADCLK                                    equ 03FAh
// bitfield definitions
ADCLK_CS_POSN                            equ 0000h
ADCLK_CS_POSITION                        equ 0000h
ADCLK_CS_SIZE                            equ 0006h
ADCLK_CS_LENGTH                          equ 0006h
ADCLK_CS_MASK                            equ 003Fh
ADCLK_ADCS0_POSN                         equ 0000h
ADCLK_ADCS0_POSITION                     equ 0000h
ADCLK_ADCS0_SIZE                         equ 0001h
ADCLK_ADCS0_LENGTH                       equ 0001h
ADCLK_ADCS0_MASK                         equ 0001h
ADCLK_ADCS1_POSN                         equ 0001h
ADCLK_ADCS1_POSITION                     equ 0001h
ADCLK_ADCS1_SIZE                         equ 0001h
ADCLK_ADCS1_LENGTH                       equ 0001h
ADCLK_ADCS1_MASK                         equ 0002h
ADCLK_ADCS2_POSN                         equ 0002h
ADCLK_ADCS2_POSITION                     equ 0002h
ADCLK_ADCS2_SIZE                         equ 0001h
ADCLK_ADCS2_LENGTH                       equ 0001h
ADCLK_ADCS2_MASK                         equ 0004h
ADCLK_ADCS3_POSN                         equ 0003h
ADCLK_ADCS3_POSITION                     equ 0003h
ADCLK_ADCS3_SIZE                         equ 0001h
ADCLK_ADCS3_LENGTH                       equ 0001h
ADCLK_ADCS3_MASK                         equ 0008h
ADCLK_ADCS4_POSN                         equ 0004h
ADCLK_ADCS4_POSITION                     equ 0004h
ADCLK_ADCS4_SIZE                         equ 0001h
ADCLK_ADCS4_LENGTH                       equ 0001h
ADCLK_ADCS4_MASK                         equ 0010h
ADCLK_ADCS5_POSN                         equ 0005h
ADCLK_ADCS5_POSITION                     equ 0005h
ADCLK_ADCS5_SIZE                         equ 0001h
ADCLK_ADCS5_LENGTH                       equ 0001h
ADCLK_ADCS5_MASK                         equ 0020h
ADCLK_ADCS_POSN                          equ 0000h
ADCLK_ADCS_POSITION                      equ 0000h
ADCLK_ADCS_SIZE                          equ 0006h
ADCLK_ADCS_LENGTH                        equ 0006h
ADCLK_ADCS_MASK                          equ 003Fh
ADCLK_CS0_POSN                           equ 0000h
ADCLK_CS0_POSITION                       equ 0000h
ADCLK_CS0_SIZE                           equ 0001h
ADCLK_CS0_LENGTH                         equ 0001h
ADCLK_CS0_MASK                           equ 0001h
ADCLK_CS1_POSN                           equ 0001h
ADCLK_CS1_POSITION                       equ 0001h
ADCLK_CS1_SIZE                           equ 0001h
ADCLK_CS1_LENGTH                         equ 0001h
ADCLK_CS1_MASK                           equ 0002h
ADCLK_CS2_POSN                           equ 0002h
ADCLK_CS2_POSITION                       equ 0002h
ADCLK_CS2_SIZE                           equ 0001h
ADCLK_CS2_LENGTH                         equ 0001h
ADCLK_CS2_MASK                           equ 0004h
ADCLK_CS3_POSN                           equ 0003h
ADCLK_CS3_POSITION                       equ 0003h
ADCLK_CS3_SIZE                           equ 0001h
ADCLK_CS3_LENGTH                         equ 0001h
ADCLK_CS3_MASK                           equ 0008h
ADCLK_CS4_POSN                           equ 0004h
ADCLK_CS4_POSITION                       equ 0004h
ADCLK_CS4_SIZE                           equ 0001h
ADCLK_CS4_LENGTH                         equ 0001h
ADCLK_CS4_MASK                           equ 0010h
ADCLK_CS5_POSN                           equ 0005h
ADCLK_CS5_POSITION                       equ 0005h
ADCLK_CS5_SIZE                           equ 0001h
ADCLK_CS5_LENGTH                         equ 0001h
ADCLK_CS5_MASK                           equ 0020h

// Register: ADCTX
#define ADCTX ADCTX
ADCTX                                    equ 03FBh
// bitfield definitions
ADCTX_CTX_POSN                           equ 0000h
ADCTX_CTX_POSITION                       equ 0000h
ADCTX_CTX_SIZE                           equ 0002h
ADCTX_CTX_LENGTH                         equ 0002h
ADCTX_CTX_MASK                           equ 0003h
ADCTX_CTXSW_POSN                         equ 0007h
ADCTX_CTXSW_POSITION                     equ 0007h
ADCTX_CTXSW_SIZE                         equ 0001h
ADCTX_CTXSW_LENGTH                       equ 0001h
ADCTX_CTXSW_MASK                         equ 0080h
ADCTX_CTX0_POSN                          equ 0000h
ADCTX_CTX0_POSITION                      equ 0000h
ADCTX_CTX0_SIZE                          equ 0001h
ADCTX_CTX0_LENGTH                        equ 0001h
ADCTX_CTX0_MASK                          equ 0001h
ADCTX_CTX1_POSN                          equ 0001h
ADCTX_CTX1_POSITION                      equ 0001h
ADCTX_CTX1_SIZE                          equ 0001h
ADCTX_CTX1_LENGTH                        equ 0001h
ADCTX_CTX1_MASK                          equ 0002h
ADCTX_ADCTX_POSN                         equ 0000h
ADCTX_ADCTX_POSITION                     equ 0000h
ADCTX_ADCTX_SIZE                         equ 0002h
ADCTX_ADCTX_LENGTH                       equ 0002h
ADCTX_ADCTX_MASK                         equ 0003h
ADCTX_ADCTXSW_POSN                       equ 0007h
ADCTX_ADCTXSW_POSITION                   equ 0007h
ADCTX_ADCTXSW_SIZE                       equ 0001h
ADCTX_ADCTXSW_LENGTH                     equ 0001h
ADCTX_ADCTXSW_MASK                       equ 0080h
ADCTX_ADCTX0_POSN                        equ 0000h
ADCTX_ADCTX0_POSITION                    equ 0000h
ADCTX_ADCTX0_SIZE                        equ 0001h
ADCTX_ADCTX0_LENGTH                      equ 0001h
ADCTX_ADCTX0_MASK                        equ 0001h
ADCTX_ADCTX1_POSN                        equ 0001h
ADCTX_ADCTX1_POSITION                    equ 0001h
ADCTX_ADCTX1_SIZE                        equ 0001h
ADCTX_ADCTX1_LENGTH                      equ 0001h
ADCTX_ADCTX1_MASK                        equ 0002h

// Register: ADCSEL1
#define ADCSEL1 ADCSEL1
ADCSEL1                                  equ 03FCh
// bitfield definitions
ADCSEL1_SSI_POSN                         equ 0006h
ADCSEL1_SSI_POSITION                     equ 0006h
ADCSEL1_SSI_SIZE                         equ 0001h
ADCSEL1_SSI_LENGTH                       equ 0001h
ADCSEL1_SSI_MASK                         equ 0040h
ADCSEL1_CHEN_POSN                        equ 0007h
ADCSEL1_CHEN_POSITION                    equ 0007h
ADCSEL1_CHEN_SIZE                        equ 0001h
ADCSEL1_CHEN_LENGTH                      equ 0001h
ADCSEL1_CHEN_MASK                        equ 0080h

// Register: ADCSEL2
#define ADCSEL2 ADCSEL2
ADCSEL2                                  equ 03FDh
// bitfield definitions
ADCSEL2_SSI_POSN                         equ 0006h
ADCSEL2_SSI_POSITION                     equ 0006h
ADCSEL2_SSI_SIZE                         equ 0001h
ADCSEL2_SSI_LENGTH                       equ 0001h
ADCSEL2_SSI_MASK                         equ 0040h
ADCSEL2_CHEN_POSN                        equ 0007h
ADCSEL2_CHEN_POSITION                    equ 0007h
ADCSEL2_CHEN_SIZE                        equ 0001h
ADCSEL2_CHEN_LENGTH                      equ 0001h
ADCSEL2_CHEN_MASK                        equ 0080h

