GopalSaraf/Practicals/PSDL/include/proc/pic18f26q71.inc
#define IOCBP0                           BANKMASK(IOCBP), 0, b
#define IOCBP1                           BANKMASK(IOCBP), 1, b
#define IOCBP2                           BANKMASK(IOCBP), 2, b
#define IOCBP3                           BANKMASK(IOCBP), 3, b
#define IOCBP4                           BANKMASK(IOCBP), 4, b
#define IOCBP5                           BANKMASK(IOCBP), 5, b
#define IOCBP6                           BANKMASK(IOCBP), 6, b
#define IOCBP7                           BANKMASK(IOCBP), 7, b
#define IOCCF0                           BANKMASK(IOCCF), 0, b
#define IOCCF1                           BANKMASK(IOCCF), 1, b
#define IOCCF2                           BANKMASK(IOCCF), 2, b
#define IOCCF3                           BANKMASK(IOCCF), 3, b
#define IOCCF4                           BANKMASK(IOCCF), 4, b
#define IOCCF5                           BANKMASK(IOCCF), 5, b
#define IOCCF6                           BANKMASK(IOCCF), 6, b
#define IOCCF7                           BANKMASK(IOCCF), 7, b
#define IOCCN0                           BANKMASK(IOCCN), 0, b
#define IOCCN1                           BANKMASK(IOCCN), 1, b
#define IOCCN2                           BANKMASK(IOCCN), 2, b
#define IOCCN3                           BANKMASK(IOCCN), 3, b
#define IOCCN4                           BANKMASK(IOCCN), 4, b
#define IOCCN5                           BANKMASK(IOCCN), 5, b
#define IOCCN6                           BANKMASK(IOCCN), 6, b
#define IOCCN7                           BANKMASK(IOCCN), 7, b
#define IOCCP0                           BANKMASK(IOCCP), 0, b
#define IOCCP1                           BANKMASK(IOCCP), 1, b
#define IOCCP2                           BANKMASK(IOCCP), 2, b
#define IOCCP3                           BANKMASK(IOCCP), 3, b
#define IOCCP4                           BANKMASK(IOCCP), 4, b
#define IOCCP5                           BANKMASK(IOCCP), 5, b
#define IOCCP6                           BANKMASK(IOCCP), 6, b
#define IOCCP7                           BANKMASK(IOCCP), 7, b
#define IOCEF3                           BANKMASK(IOCEF), 3, b
#define IOCEN3                           BANKMASK(IOCEN), 3, b
#define IOCEP3                           BANKMASK(IOCEP), 3, b
#define IOCIE                            BANKMASK(PIE0), 7, a
#define IOCIF                            BANKMASK(PIR0), 7, a
#define IOCIP                            BANKMASK(IPR0), 7, a
#define IOCMD                            BANKMASK(PMD0), 0, b
#define IOCVIE                           BANKMASK(PIE2), 2, a
#define IOCVIF                           BANKMASK(PIR2), 2, a
#define IOCVIP                           BANKMASK(IPR2), 2, a
#define IOCWF0                           BANKMASK(IOCWF), 0, b
#define IOCWF1                           BANKMASK(IOCWF), 1, b
#define IOCWF2                           BANKMASK(IOCWF), 2, b
#define IOCWF3                           BANKMASK(IOCWF), 3, b
#define IOCWF4                           BANKMASK(IOCWF), 4, b
#define IOCWF5                           BANKMASK(IOCWF), 5, b
#define IOCWF6                           BANKMASK(IOCWF), 6, b
#define IOCWF7                           BANKMASK(IOCWF), 7, b
#define IOCWN0                           BANKMASK(IOCWN), 0, b
#define IOCWN1                           BANKMASK(IOCWN), 1, b
#define IOCWN2                           BANKMASK(IOCWN), 2, b
#define IOCWN3                           BANKMASK(IOCWN), 3, b
#define IOCWN4                           BANKMASK(IOCWN), 4, b
#define IOCWN5                           BANKMASK(IOCWN), 5, b
#define IOCWN6                           BANKMASK(IOCWN), 6, b
#define IOCWN7                           BANKMASK(IOCWN), 7, b
#define IOCWP0                           BANKMASK(IOCWP), 0, b
#define IOCWP1                           BANKMASK(IOCWP), 1, b
#define IOCWP2                           BANKMASK(IOCWP), 2, b
#define IOCWP3                           BANKMASK(IOCWP), 3, b
#define IOCWP4                           BANKMASK(IOCWP), 4, b
#define IOCWP5                           BANKMASK(IOCWP), 5, b
#define IOCWP6                           BANKMASK(IOCWP), 6, b
#define IOCWP7                           BANKMASK(IOCWP), 7, b
#define ISM0                             BANKMASK(CWG1ISM), 0, b
#define ISM1                             BANKMASK(CWG1ISM), 1, b
#define ISM2                             BANKMASK(CWG1ISM), 2, b
#define ISM3                             BANKMASK(CWG1ISM), 3, b
#define ISM4                             BANKMASK(CWG1ISM), 4, b
#define ISRPR0                           BANKMASK(ISRPR), 0, b
#define ISRPR1                           BANKMASK(ISRPR), 1, b
#define ISRPR2                           BANKMASK(ISRPR), 2, b
#define IVTLOCKED                        BANKMASK(IVTLOCK), 0, b
#define LADR0                            BANKMASK(SCANLADRL), 0, b
#define LADR1                            BANKMASK(SCANLADRL), 1, b
#define LADR10                           BANKMASK(SCANLADRH), 2, b
#define LADR11                           BANKMASK(SCANLADRH), 3, b
#define LADR12                           BANKMASK(SCANLADRH), 4, b
#define LADR13                           BANKMASK(SCANLADRH), 5, b
#define LADR14                           BANKMASK(SCANLADRH), 6, b
#define LADR15                           BANKMASK(SCANLADRH), 7, b
#define LADR16                           BANKMASK(SCANLADRU), 0, b
#define LADR17                           BANKMASK(SCANLADRU), 1, b
#define LADR18                           BANKMASK(SCANLADRU), 2, b
#define LADR19                           BANKMASK(SCANLADRU), 3, b
#define LADR2                            BANKMASK(SCANLADRL), 2, b
#define LADR20                           BANKMASK(SCANLADRU), 4, b
#define LADR21                           BANKMASK(SCANLADRU), 5, b
#define LADR3                            BANKMASK(SCANLADRL), 3, b
#define LADR4                            BANKMASK(SCANLADRL), 4, b
#define LADR5                            BANKMASK(SCANLADRL), 5, b
#define LADR6                            BANKMASK(SCANLADRL), 6, b
#define LADR7                            BANKMASK(SCANLADRL), 7, b
#define LADR8                            BANKMASK(SCANLADRH), 0, b
#define LADR9                            BANKMASK(SCANLADRH), 1, b
#define LATA0                            BANKMASK(LATA), 0, b
#define LATA1                            BANKMASK(LATA), 1, b
#define LATA2                            BANKMASK(LATA), 2, b
#define LATA3                            BANKMASK(LATA), 3, b
#define LATA4                            BANKMASK(LATA), 4, b
#define LATA5                            BANKMASK(LATA), 5, b
#define LATA6                            BANKMASK(LATA), 6, b
#define LATA7                            BANKMASK(LATA), 7, b
#define LATB0                            BANKMASK(LATB), 0, b
#define LATB1                            BANKMASK(LATB), 1, b
#define LATB2                            BANKMASK(LATB), 2, b
#define LATB3                            BANKMASK(LATB), 3, b
#define LATB4                            BANKMASK(LATB), 4, b
#define LATB5                            BANKMASK(LATB), 5, b
#define LATB6                            BANKMASK(LATB), 6, b
#define LATB7                            BANKMASK(LATB), 7, b
#define LATC0                            BANKMASK(LATC), 0, b
#define LATC1                            BANKMASK(LATC), 1, b
#define LATC2                            BANKMASK(LATC), 2, b
#define LATC3                            BANKMASK(LATC), 3, b
#define LATC4                            BANKMASK(LATC), 4, b
#define LATC5                            BANKMASK(LATC), 5, b
#define LATC6                            BANKMASK(LATC), 6, b
#define LATC7                            BANKMASK(LATC), 7, b
#define LATW0                            BANKMASK(LATW), 0, b
#define LATW1                            BANKMASK(LATW), 1, b
#define LATW2                            BANKMASK(LATW), 2, b
#define LATW3                            BANKMASK(LATW), 3, b
#define LATW4                            BANKMASK(LATW), 4, b
#define LATW5                            BANKMASK(LATW), 5, b
#define LATW6                            BANKMASK(LATW), 6, b
#define LATW7                            BANKMASK(LATW), 7, b
#define LENDIAN                          BANKMASK(CRCCON0), 1, b
#define LFOEN                            BANKMASK(OSCEN), 4, b
#define LFOR                             BANKMASK(OSCSTAT), 4, b
#define LOCK                             BANKMASK(ACTCON), 3, b
#define LSAC0                            BANKMASK(CWG1AS0), 2, b
#define LSAC1                            BANKMASK(CWG1AS0), 3, b
#define LSBD0                            BANKMASK(CWG1AS0), 4, b
#define LSBD1                            BANKMASK(CWG1AS0), 5, b
#define LSBF                             BANKMASK(SPI1CON0), 2, b
#define LSCA1                            BANKMASK(CWG1AS0), 3, b
#define LSDB0                            BANKMASK(CWG1AS0), 4, b
#define LSDB1                            BANKMASK(CWG1AS0), 5, b
#define LTH0                             BANKMASK(ADLTHL), 0, b
#define LTH1                             BANKMASK(ADLTHL), 1, b
#define LTH10                            BANKMASK(ADLTHH), 2, b
#define LTH11                            BANKMASK(ADLTHH), 3, b
#define LTH12                            BANKMASK(ADLTHH), 4, b
#define LTH13                            BANKMASK(ADLTHH), 5, b
#define LTH14                            BANKMASK(ADLTHH), 6, b
#define LTH15                            BANKMASK(ADLTHH), 7, b
#define LTH2                             BANKMASK(ADLTHL), 2, b
#define LTH3                             BANKMASK(ADLTHL), 3, b
#define LTH4                             BANKMASK(ADLTHL), 4, b
#define LTH5                             BANKMASK(ADLTHL), 5, b
#define LTH6                             BANKMASK(ADLTHL), 6, b
#define LTH7                             BANKMASK(ADLTHL), 7, b
#define LTH8                             BANKMASK(ADLTHH), 0, b
#define LTH9                             BANKMASK(ADLTHH), 1, b
#define LTHR                             BANKMASK(ADSTAT), 5, b
#define LVDMD                            BANKMASK(PMD0), 5, b
#define MAINPR0                          BANKMASK(MAINPR), 0, b
#define MAINPR1                          BANKMASK(MAINPR), 1, b
#define MAINPR2                          BANKMASK(MAINPR), 2, b
#define MATH                             BANKMASK(ADSTAT), 4, b
#define MC1OUT                           BANKMASK(CMOUT), 0, b
#define MC2OUT                           BANKMASK(CMOUT), 1, b
#define MD0                              BANKMASK(ADCON2), 0, b
#define MD1                              BANKMASK(ADCON2), 1, b
#define MD16                             BANKMASK(T0CON0), 4, b
#define MD2                              BANKMASK(ADCON2), 2, b
#define MDR                              BANKMASK(I2C1CON0), 3, b
#define MEMV                             BANKMASK(PCON1), 1, a
#define MFOEN                            BANKMASK(OSCEN), 5, b
#define MFOR                             BANKMASK(OSCSTAT), 5, b
#define MMA                              BANKMASK(I2C1STAT0), 5, b
#define MPWM1EN                          BANKMASK(PWMEN), 0, a
#define MPWM1LD                          BANKMASK(PWMLOAD), 0, a
#define MPWM2EN                          BANKMASK(PWMEN), 1, a
#define MPWM2LD                          BANKMASK(PWMLOAD), 1, a
#define MPWM3EN                          BANKMASK(PWMEN), 2, a
#define MPWM3LD                          BANKMASK(PWMLOAD), 2, a
#define MREG                             BANKMASK(SCANCON0), 2, b
#define MST                              BANKMASK(SPI1CON0), 1, b
#define NACK1IE                          BANKMASK(I2C1ERR), 0, b
#define NACK1IF                          BANKMASK(I2C1ERR), 4, b
#define NACKIE                           BANKMASK(I2C1ERR), 0, b
#define NACKIF                           BANKMASK(I2C1ERR), 4, b
#define NCO1ACC0                         BANKMASK(NCO1ACCL), 0, b
#define NCO1ACC1                         BANKMASK(NCO1ACCL), 1, b
#define NCO1ACC10                        BANKMASK(NCO1ACCH), 2, b
#define NCO1ACC11                        BANKMASK(NCO1ACCH), 3, b
#define NCO1ACC12                        BANKMASK(NCO1ACCH), 4, b
#define NCO1ACC13                        BANKMASK(NCO1ACCH), 5, b
#define NCO1ACC14                        BANKMASK(NCO1ACCH), 6, b
#define NCO1ACC15                        BANKMASK(NCO1ACCH), 7, b
#define NCO1ACC16                        BANKMASK(NCO1ACCU), 0, b
#define NCO1ACC17                        BANKMASK(NCO1ACCU), 1, b
#define NCO1ACC18                        BANKMASK(NCO1ACCU), 2, b
#define NCO1ACC19                        BANKMASK(NCO1ACCU), 3, b
#define NCO1ACC2                         BANKMASK(NCO1ACCL), 2, b
#define NCO1ACC3                         BANKMASK(NCO1ACCL), 3, b
#define NCO1ACC4                         BANKMASK(NCO1ACCL), 4, b
#define NCO1ACC5                         BANKMASK(NCO1ACCL), 5, b
#define NCO1ACC6                         BANKMASK(NCO1ACCL), 6, b
#define NCO1ACC7                         BANKMASK(NCO1ACCL), 7, b
#define NCO1ACC8                         BANKMASK(NCO1ACCH), 0, b
#define NCO1ACC9                         BANKMASK(NCO1ACCH), 1, b
#define NCO1CKS0                         BANKMASK(NCO1CLK), 0, b
#define NCO1CKS1                         BANKMASK(NCO1CLK), 1, b
#define NCO1CKS2                         BANKMASK(NCO1CLK), 2, b
#define NCO1CKS3                         BANKMASK(NCO1CLK), 3, b
#define NCO1CKS4                         BANKMASK(NCO1CLK), 4, b
#define NCO1EN                           BANKMASK(NCO1CON), 7, b
#define NCO1IE                           BANKMASK(PIE6), 3, a
#define NCO1IF                           BANKMASK(PIR6), 3, a
#define NCO1INC0                         BANKMASK(NCO1INCL), 0, b
#define NCO1INC1                         BANKMASK(NCO1INCL), 1, b
#define NCO1INC10                        BANKMASK(NCO1INCH), 2, b
#define NCO1INC11                        BANKMASK(NCO1INCH), 3, b
#define NCO1INC12                        BANKMASK(NCO1INCH), 4, b
#define NCO1INC13                        BANKMASK(NCO1INCH), 5, b
#define NCO1INC14                        BANKMASK(NCO1INCH), 6, b
#define NCO1INC15                        BANKMASK(NCO1INCH), 7, b
#define NCO1INC16                        BANKMASK(NCO1INCU), 0, b
#define NCO1INC17                        BANKMASK(NCO1INCU), 1, b
#define NCO1INC18                        BANKMASK(NCO1INCU), 2, b
#define NCO1INC19                        BANKMASK(NCO1INCU), 3, b
#define NCO1INC2                         BANKMASK(NCO1INCL), 2, b
#define NCO1INC3                         BANKMASK(NCO1INCL), 3, b
#define NCO1INC4                         BANKMASK(NCO1INCL), 4, b
#define NCO1INC5                         BANKMASK(NCO1INCL), 5, b
#define NCO1INC6                         BANKMASK(NCO1INCL), 6, b
#define NCO1INC7                         BANKMASK(NCO1INCL), 7, b
#define NCO1INC8                         BANKMASK(NCO1INCH), 0, b
#define NCO1INC9                         BANKMASK(NCO1INCH), 1, b
#define NCO1IP                           BANKMASK(IPR6), 3, a
#define NCO1MD                           BANKMASK(PMD2), 4, b
#define NCO1OUT                          BANKMASK(NCO1CON), 5, b
#define NCO1PFM                          BANKMASK(NCO1CON), 0, b
#define NCO1POL                          BANKMASK(NCO1CON), 4, b
#define NCO1PWS0                         BANKMASK(NCO1CLK), 5, b
#define NCO1PWS1                         BANKMASK(NCO1CLK), 6, b
#define NCO1PWS2                         BANKMASK(NCO1CLK), 7, b
#define NDIV0                            BANKMASK(OSCCON1), 0, b
#define NDIV1                            BANKMASK(OSCCON1), 1, b
#define NDIV2                            BANKMASK(OSCCON1), 2, b
#define NDIV3                            BANKMASK(OSCCON1), 3, b
#define NOSC0                            BANKMASK(OSCCON1), 4, b
#define NOSC1                            BANKMASK(OSCCON1), 5, b
#define NOSC2                            BANKMASK(OSCCON1), 6, b
#define NOSCR                            BANKMASK(OSCCON3), 3, b
#define NOT_A                            BANKMASK(I2C1STAT0), 3, b
#define NOT_ADDRESS                      BANKMASK(I2C1STAT0), 3, b
#define NOT_BOR                          BANKMASK(PCON0), 0, a
#define NOT_MEMV                         BANKMASK(PCON1), 1, a
#define NOT_POR                          BANKMASK(PCON0), 1, a
#define NOT_RCM                          BANKMASK(PCON1), 0, a
#define NOT_RI                           BANKMASK(PCON0), 2, a
#define NOT_RMCLR                        BANKMASK(PCON0), 3, a
#define NOT_RVREG                        BANKMASK(PCON1), 2, a
#define NOT_RWDT                         BANKMASK(PCON0), 4, a
#define NOT_T1DONE                       BANKMASK(T1GCON), 3, b
#define NOT_T1SYNC                       BANKMASK(T1CON), 2, b
#define NOT_T3DONE                       BANKMASK(T3GCON), 3, b
#define NOT_T3SYNC                       BANKMASK(T3CON), 2, b
#define NOT_W                            BANKMASK(I2C1STAT0), 4, b
#define NOT_WDTWV                        BANKMASK(PCON0), 5, a
#define NOT_WRITE                        BANKMASK(I2C1STAT0), 4, b
#define NREF0                            BANKMASK(ADREF), 4, b
#define NVMADR0                          BANKMASK(NVMADRL), 0, b
#define NVMADR1                          BANKMASK(NVMADRL), 1, b
#define NVMADR10                         BANKMASK(NVMADRH), 2, b
#define NVMADR11                         BANKMASK(NVMADRH), 3, b
#define NVMADR12                         BANKMASK(NVMADRH), 4, b
#define NVMADR13                         BANKMASK(NVMADRH), 5, b
#define NVMADR14                         BANKMASK(NVMADRH), 6, b
#define NVMADR15                         BANKMASK(NVMADRH), 7, b
#define NVMADR16                         BANKMASK(NVMADRU), 0, b
#define NVMADR17                         BANKMASK(NVMADRU), 1, b
#define NVMADR18                         BANKMASK(NVMADRU), 2, b
#define NVMADR19                         BANKMASK(NVMADRU), 3, b
#define NVMADR2                          BANKMASK(NVMADRL), 2, b
#define NVMADR20                         BANKMASK(NVMADRU), 4, b
#define NVMADR21                         BANKMASK(NVMADRU), 5, b
#define NVMADR3                          BANKMASK(NVMADRL), 3, b
#define NVMADR4                          BANKMASK(NVMADRL), 4, b
#define NVMADR5                          BANKMASK(NVMADRL), 5, b
#define NVMADR6                          BANKMASK(NVMADRL), 6, b
#define NVMADR7                          BANKMASK(NVMADRL), 7, b
#define NVMADR8                          BANKMASK(NVMADRH), 0, b
#define NVMADR9                          BANKMASK(NVMADRH), 1, b
#define NVMDAT0                          BANKMASK(NVMDATL), 0, b
#define NVMDAT1                          BANKMASK(NVMDATL), 1, b
#define NVMDAT10                         BANKMASK(NVMDATH), 2, b
#define NVMDAT11                         BANKMASK(NVMDATH), 3, b
#define NVMDAT12                         BANKMASK(NVMDATH), 4, b
#define NVMDAT13                         BANKMASK(NVMDATH), 5, b
#define NVMDAT14                         BANKMASK(NVMDATH), 6, b
#define NVMDAT15                         BANKMASK(NVMDATH), 7, b
#define NVMDAT2                          BANKMASK(NVMDATL), 2, b
#define NVMDAT3                          BANKMASK(NVMDATL), 3, b
#define NVMDAT4                          BANKMASK(NVMDATL), 4, b
#define NVMDAT5                          BANKMASK(NVMDATL), 5, b
#define NVMDAT6                          BANKMASK(NVMDATL), 6, b
#define NVMDAT7                          BANKMASK(NVMDATL), 7, b
#define NVMDAT8                          BANKMASK(NVMDATH), 0, b
#define NVMDAT9                          BANKMASK(NVMDATH), 1, b
#define NVMGO                            BANKMASK(NVMCON0), 0, b
#define NVMIE                            BANKMASK(PIE0), 4, a
#define NVMIF                            BANKMASK(PIR0), 4, a
#define NVMIP                            BANKMASK(IPR0), 4, a
#define ODCA0                            BANKMASK(ODCONA), 0, b
#define ODCA1                            BANKMASK(ODCONA), 1, b
#define ODCA2                            BANKMASK(ODCONA), 2, b
#define ODCA3                            BANKMASK(ODCONA), 3, b
#define ODCA4                            BANKMASK(ODCONA), 4, b
#define ODCA5                            BANKMASK(ODCONA), 5, b
#define ODCA6                            BANKMASK(ODCONA), 6, b
#define ODCA7                            BANKMASK(ODCONA), 7, b
#define ODCB0                            BANKMASK(ODCONB), 0, b
#define ODCB1                            BANKMASK(ODCONB), 1, b
#define ODCB2                            BANKMASK(ODCONB), 2, b
#define ODCB3                            BANKMASK(ODCONB), 3, b
#define ODCB4                            BANKMASK(ODCONB), 4, b
#define ODCB5                            BANKMASK(ODCONB), 5, b
#define ODCB6                            BANKMASK(ODCONB), 6, b
#define ODCB7                            BANKMASK(ODCONB), 7, b
#define ODCC0                            BANKMASK(ODCONC), 0, b
#define ODCC1                            BANKMASK(ODCONC), 1, b
#define ODCC2                            BANKMASK(ODCONC), 2, b
#define ODCC3                            BANKMASK(ODCONC), 3, b
#define ODCC4                            BANKMASK(ODCONC), 4, b
#define ODCC5                            BANKMASK(ODCONC), 5, b
#define ODCC6                            BANKMASK(ODCONC), 6, b
#define ODCC7                            BANKMASK(ODCONC), 7, b
#define OPA1CPON                         BANKMASK(OPA1CON0), 5, b
#define OPA1EN                           BANKMASK(OPA1CON0), 7, b
#define OPA1FMS0                         BANKMASK(OPA1CON3), 6, b
#define OPA1FMS1                         BANKMASK(OPA1CON3), 7, b
#define OPA1GSEL0                        BANKMASK(OPA1CON1), 4, b
#define OPA1GSEL1                        BANKMASK(OPA1CON1), 5, b
#define OPA1GSEL2                        BANKMASK(OPA1CON1), 6, b
#define OPA1HWCH0                        BANKMASK(OPA1HWC), 4, b
#define OPA1HWCH1                        BANKMASK(OPA1HWC), 5, b
#define OPA1HWCH2                        BANKMASK(OPA1HWC), 6, b
#define OPA1HWCL0                        BANKMASK(OPA1HWC), 0, b
#define OPA1HWCL1                        BANKMASK(OPA1HWC), 1, b
#define OPA1HWCL2                        BANKMASK(OPA1HWC), 2, b
#define OPA1INTOE                        BANKMASK(OPA1CON3), 5, b
#define OPA1MD                           BANKMASK(PMD5), 2, b
#define OPA1NCH0                         BANKMASK(OPA1CON2), 4, b
#define OPA1NCH1                         BANKMASK(OPA1CON2), 5, b
#define OPA1NCH2                         BANKMASK(OPA1CON2), 6, b
#define OPA1NSS0                         BANKMASK(OPA1CON1), 0, b
#define OPA1NSS1                         BANKMASK(OPA1CON1), 1, b
#define OPA1NSS2                         BANKMASK(OPA1CON1), 2, b
#define OPA1OFCSEL0                      BANKMASK(OPA1CON4), 0, b
#define OPA1OFCSEL1                      BANKMASK(OPA1CON4), 1, b
#define OPA1OFCST                        BANKMASK(OPA1CON4), 2, b
#define OPA1OFFSET0                      BANKMASK(OPA1OFFSET), 0, b
#define OPA1OFFSET1                      BANKMASK(OPA1OFFSET), 1, b
#define OPA1OFFSET2                      BANKMASK(OPA1OFFSET), 2, b
#define OPA1OFFSET3                      BANKMASK(OPA1OFFSET), 3, b
#define OPA1OFFSET4                      BANKMASK(OPA1OFFSET), 4, b
#define OPA1OFFSET5                      BANKMASK(OPA1OFFSET), 5, b
#define OPA1OFFSET6                      BANKMASK(OPA1OFFSET), 6, b
#define OPA1OFFSET7                      BANKMASK(OPA1OFFSET), 7, b
#define OPA1OREN                         BANKMASK(OPA1HWC), 7, b
#define OPA1ORPOL                        BANKMASK(OPA1HWC), 3, b
#define OPA1ORS0                         BANKMASK(OPA1ORS), 0, b
#define OPA1ORS1                         BANKMASK(OPA1ORS), 1, b
#define OPA1ORS2                         BANKMASK(OPA1ORS), 2, b
#define OPA1ORS3                         BANKMASK(OPA1ORS), 3, b
