GopalSaraf/Practicals/PSDL/include/proc/pic18f26q71.inc
#define OPA1ORS4                         BANKMASK(OPA1ORS), 4, b
#define OPA1PCH0                         BANKMASK(OPA1CON2), 0, b
#define OPA1PCH1                         BANKMASK(OPA1CON2), 1, b
#define OPA1PCH2                         BANKMASK(OPA1CON2), 2, b
#define OPA1PPS0                         BANKMASK(OPA1ORPPS), 0, b
#define OPA1PPS1                         BANKMASK(OPA1ORPPS), 1, b
#define OPA1PPS2                         BANKMASK(OPA1ORPPS), 2, b
#define OPA1PPS3                         BANKMASK(OPA1ORPPS), 3, b
#define OPA1PPS4                         BANKMASK(OPA1ORPPS), 4, b
#define OPA1PPS5                         BANKMASK(OPA1ORPPS), 5, b
#define OPA1PSS0                         BANKMASK(OPA1CON3), 0, b
#define OPA1PSS1                         BANKMASK(OPA1CON3), 1, b
#define OPA1PTRES                        BANKMASK(OPA1CON4), 4, b
#define OPA1RESON                        BANKMASK(OPA1CON1), 3, b
#define OPA1UG                           BANKMASK(OPA1CON0), 3, b
#define OPA2CPON                         BANKMASK(OPA2CON0), 5, b
#define OPA2EN                           BANKMASK(OPA2CON0), 7, b
#define OPA2FMS0                         BANKMASK(OPA2CON3), 6, b
#define OPA2FMS1                         BANKMASK(OPA2CON3), 7, b
#define OPA2GSEL0                        BANKMASK(OPA2CON1), 4, b
#define OPA2GSEL1                        BANKMASK(OPA2CON1), 5, b
#define OPA2GSEL2                        BANKMASK(OPA2CON1), 6, b
#define OPA2HWCH0                        BANKMASK(OPA2HWC), 4, b
#define OPA2HWCH1                        BANKMASK(OPA2HWC), 5, b
#define OPA2HWCH2                        BANKMASK(OPA2HWC), 6, b
#define OPA2HWCL0                        BANKMASK(OPA2HWC), 0, b
#define OPA2HWCL1                        BANKMASK(OPA2HWC), 1, b
#define OPA2HWCL2                        BANKMASK(OPA2HWC), 2, b
#define OPA2INTOE                        BANKMASK(OPA2CON3), 5, b
#define OPA2MD                           BANKMASK(PMD5), 3, b
#define OPA2NCH0                         BANKMASK(OPA2CON2), 4, b
#define OPA2NCH1                         BANKMASK(OPA2CON2), 5, b
#define OPA2NCH2                         BANKMASK(OPA2CON2), 6, b
#define OPA2NSS0                         BANKMASK(OPA2CON1), 0, b
#define OPA2NSS1                         BANKMASK(OPA2CON1), 1, b
#define OPA2NSS2                         BANKMASK(OPA2CON1), 2, b
#define OPA2OFCSEL0                      BANKMASK(OPA2CON4), 0, b
#define OPA2OFCSEL1                      BANKMASK(OPA2CON4), 1, b
#define OPA2OFCST                        BANKMASK(OPA2CON4), 2, b
#define OPA2OFFSET0                      BANKMASK(OPA2OFFSET), 0, b
#define OPA2OFFSET1                      BANKMASK(OPA2OFFSET), 1, b
#define OPA2OFFSET2                      BANKMASK(OPA2OFFSET), 2, b
#define OPA2OFFSET3                      BANKMASK(OPA2OFFSET), 3, b
#define OPA2OFFSET4                      BANKMASK(OPA2OFFSET), 4, b
#define OPA2OFFSET5                      BANKMASK(OPA2OFFSET), 5, b
#define OPA2OFFSET6                      BANKMASK(OPA2OFFSET), 6, b
#define OPA2OFFSET7                      BANKMASK(OPA2OFFSET), 7, b
#define OPA2OREN                         BANKMASK(OPA2HWC), 7, b
#define OPA2ORPOL                        BANKMASK(OPA2HWC), 3, b
#define OPA2ORS0                         BANKMASK(OPA2ORS), 0, b
#define OPA2ORS1                         BANKMASK(OPA2ORS), 1, b
#define OPA2ORS2                         BANKMASK(OPA2ORS), 2, b
#define OPA2ORS3                         BANKMASK(OPA2ORS), 3, b
#define OPA2ORS4                         BANKMASK(OPA2ORS), 4, b
#define OPA2ORS5                         BANKMASK(OPA2ORS), 5, b
#define OPA2ORS6                         BANKMASK(OPA2ORS), 6, b
#define OPA2ORS7                         BANKMASK(OPA2ORS), 7, b
#define OPA2PCH0                         BANKMASK(OPA2CON2), 0, b
#define OPA2PCH1                         BANKMASK(OPA2CON2), 1, b
#define OPA2PCH2                         BANKMASK(OPA2CON2), 2, b
#define OPA2PPS0                         BANKMASK(OPA2ORPPS), 0, b
#define OPA2PPS1                         BANKMASK(OPA2ORPPS), 1, b
#define OPA2PPS2                         BANKMASK(OPA2ORPPS), 2, b
#define OPA2PPS3                         BANKMASK(OPA2ORPPS), 3, b
#define OPA2PPS4                         BANKMASK(OPA2ORPPS), 4, b
#define OPA2PPS5                         BANKMASK(OPA2ORPPS), 5, b
#define OPA2PSS0                         BANKMASK(OPA2CON3), 0, b
#define OPA2PSS1                         BANKMASK(OPA2CON3), 1, b
#define OPA2PSS2                         BANKMASK(OPA2CON3), 2, b
#define OPA2PSS3                         BANKMASK(OPA2CON3), 3, b
#define OPA2PSS4                         BANKMASK(OPA2CON3), 4, b
#define OPA2PTRES                        BANKMASK(OPA2CON4), 4, b
#define OPA2RESON                        BANKMASK(OPA2CON1), 3, b
#define OPA2UG                           BANKMASK(OPA2CON0), 3, b
#define ORDY                             BANKMASK(OSCCON3), 4, b
#define ORS                              BANKMASK(ACTCON), 1, b
#define ORS5                             BANKMASK(OPA2ORS), 5, b
#define ORS6                             BANKMASK(OPA2ORS), 6, b
#define ORS7                             BANKMASK(OPA2ORS), 7, b
#define OSFIE                            BANKMASK(PIE0), 2, a
#define OSFIF                            BANKMASK(PIR0), 2, a
#define OSFIP                            BANKMASK(IPR0), 2, a
#define OUT0                             BANKMASK(CRCOUTL), 0, b
#define OUT1                             BANKMASK(CRCOUTL), 1, b
#define OUT10                            BANKMASK(CRCOUTH), 2, b
#define OUT11                            BANKMASK(CRCOUTH), 3, b
#define OUT12                            BANKMASK(CRCOUTH), 4, b
#define OUT13                            BANKMASK(CRCOUTH), 5, b
#define OUT14                            BANKMASK(CRCOUTH), 6, b
#define OUT15                            BANKMASK(CRCOUTH), 7, b
#define OUT16                            BANKMASK(CRCOUTU), 0, b
#define OUT17                            BANKMASK(CRCOUTU), 1, b
#define OUT18                            BANKMASK(CRCOUTU), 2, b
#define OUT19                            BANKMASK(CRCOUTU), 3, b
#define OUT2                             BANKMASK(CRCOUTL), 2, b
#define OUT20                            BANKMASK(CRCOUTU), 4, b
#define OUT21                            BANKMASK(CRCOUTU), 5, b
#define OUT22                            BANKMASK(CRCOUTU), 6, b
#define OUT23                            BANKMASK(CRCOUTU), 7, b
#define OUT24                            BANKMASK(CRCOUTT), 0, b
#define OUT25                            BANKMASK(CRCOUTT), 1, b
#define OUT26                            BANKMASK(CRCOUTT), 2, b
#define OUT27                            BANKMASK(CRCOUTT), 3, b
#define OUT28                            BANKMASK(CRCOUTT), 4, b
#define OUT29                            BANKMASK(CRCOUTT), 5, b
#define OUT3                             BANKMASK(CRCOUTL), 3, b
#define OUT30                            BANKMASK(CRCOUTT), 6, b
#define OUT31                            BANKMASK(CRCOUTT), 7, b
#define OUT4                             BANKMASK(CRCOUTL), 4, b
#define OUT5                             BANKMASK(CRCOUTL), 5, b
#define OUT6                             BANKMASK(CRCOUTL), 6, b
#define OUT7                             BANKMASK(CRCOUTL), 7, b
#define OUT8                             BANKMASK(CRCOUTH), 0, b
#define OUT9                             BANKMASK(CRCOUTH), 1, b
#define OVRA                             BANKMASK(CWG1STR), 4, b
#define OVRB                             BANKMASK(CWG1STR), 5, b
#define OVRC                             BANKMASK(CWG1STR), 6, b
#define OVRD                             BANKMASK(CWG1STR), 7, b
#define P1H                              BANKMASK(U1P1H), 0, b
#define P2H                              BANKMASK(U1P2H), 0, b
#define P3H                              BANKMASK(U1P3H), 0, b
#define PC1IE                            BANKMASK(I2C1PIE), 2, b
#define PC1IF                            BANKMASK(I2C1PIR), 2, b
#define PCIE                             BANKMASK(I2C1PIE), 2, b
#define PCIF                             BANKMASK(I2C1PIR), 2, b
#define PCSC                             BANKMASK(ADCON1), 1, b
#define PER0                             BANKMASK(APMPERL), 0, b
#define PER1                             BANKMASK(APMPERL), 1, b
#define PER10                            BANKMASK(APMPERH), 2, b
#define PER11                            BANKMASK(APMPERH), 3, b
#define PER12                            BANKMASK(APMPERH), 4, b
#define PER13                            BANKMASK(APMPERH), 5, b
#define PER14                            BANKMASK(APMPERH), 6, b
#define PER15                            BANKMASK(APMPERH), 7, b
#define PER2                             BANKMASK(APMPERL), 2, b
#define PER3                             BANKMASK(APMPERL), 3, b
#define PER4                             BANKMASK(APMPERL), 4, b
#define PER5                             BANKMASK(APMPERL), 5, b
#define PER6                             BANKMASK(APMPERL), 6, b
#define PER7                             BANKMASK(APMPERL), 7, b
#define PER8                             BANKMASK(APMPERH), 0, b
#define PER9                             BANKMASK(APMPERH), 1, b
#define PFM                              BANKMASK(NCO1CON), 0, b
#define PLEN0                            BANKMASK(CRCCON1), 0, b
#define PLEN1                            BANKMASK(CRCCON1), 1, b
#define PLEN2                            BANKMASK(CRCCON1), 2, b
#define PLEN3                            BANKMASK(CRCCON1), 3, b
#define PLEN4                            BANKMASK(CRCCON1), 4, b
#define PLLEN                            BANKMASK(OSCEN), 0, b
#define PLLR                             BANKMASK(OSCSTAT), 0, b
#define PMSYS0                           BANKMASK(VREGCON), 4, b
#define PMSYS1                           BANKMASK(VREGCON), 5, b
#define POLA                             BANKMASK(CWG1CON1), 0, b
#define POLB                             BANKMASK(CWG1CON1), 1, b
#define POLC                             BANKMASK(CWG1CON1), 2, b
#define POLD                             BANKMASK(CWG1CON1), 3, b
#define POR                              BANKMASK(PCON0), 1, a
#define PPOL                             BANKMASK(ADCON1), 7, b
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0, b
#define PRE13                            BANKMASK(APMPREH), 5, b
#define PRE14                            BANKMASK(APMPREH), 6, b
#define PRE15                            BANKMASK(APMPREH), 7, b
#define PREF0                            BANKMASK(ADREF), 0, b
#define PREF1                            BANKMASK(ADREF), 1, b
#define PREV0                            BANKMASK(ADPREVL), 0, b
#define PREV1                            BANKMASK(ADPREVL), 1, b
#define PREV10                           BANKMASK(ADPREVH), 2, b
#define PREV11                           BANKMASK(ADPREVH), 3, b
#define PREV12                           BANKMASK(ADPREVH), 4, b
#define PREV13                           BANKMASK(ADPREVH), 5, b
#define PREV14                           BANKMASK(ADPREVH), 6, b
#define PREV15                           BANKMASK(ADPREVH), 7, b
#define PREV2                            BANKMASK(ADPREVL), 2, b
#define PREV3                            BANKMASK(ADPREVL), 3, b
#define PREV4                            BANKMASK(ADPREVL), 4, b
#define PREV5                            BANKMASK(ADPREVL), 5, b
#define PREV6                            BANKMASK(ADPREVL), 6, b
#define PREV7                            BANKMASK(ADPREVL), 7, b
#define PREV8                            BANKMASK(ADPREVH), 0, b
#define PREV9                            BANKMASK(ADPREVH), 1, b
#define PRLOCKED                         BANKMASK(PRLOCK), 0, b
#define PSCNT0                           BANKMASK(WDTPSL), 0, b
#define PSCNT1                           BANKMASK(WDTPSL), 1, b
#define PSCNT10                          BANKMASK(WDTPSH), 2, b
#define PSCNT11                          BANKMASK(WDTPSH), 3, b
#define PSCNT12                          BANKMASK(WDTPSH), 4, b
#define PSCNT13                          BANKMASK(WDTPSH), 5, b
#define PSCNT14                          BANKMASK(WDTPSH), 6, b
#define PSCNT15                          BANKMASK(WDTPSH), 7, b
#define PSCNT16                          BANKMASK(WDTTMR), 0, b
#define PSCNT17                          BANKMASK(WDTTMR), 1, b
#define PSCNT2                           BANKMASK(WDTPSL), 2, b
#define PSCNT3                           BANKMASK(WDTPSL), 3, b
#define PSCNT4                           BANKMASK(WDTPSL), 4, b
#define PSCNT5                           BANKMASK(WDTPSL), 5, b
#define PSCNT6                           BANKMASK(WDTPSL), 6, b
#define PSCNT7                           BANKMASK(WDTPSL), 7, b
#define PSCNT8                           BANKMASK(WDTPSH), 0, b
#define PSCNT9                           BANKMASK(WDTPSH), 1, b
#define PSIS                             BANKMASK(ADCON2), 7, b
#define PSS2                             BANKMASK(OPA2CON3), 2, b
#define PSS3                             BANKMASK(OPA2CON3), 3, b
#define PSS4                             BANKMASK(OPA2CON3), 4, b
#define PWCLKEN                          BANKMASK(VPORTCON), 0, b
#define PWDF0                            BANKMASK(PORTWDF), 0, b
#define PWDF1                            BANKMASK(PORTWDF), 1, b
#define PWDF2                            BANKMASK(PORTWDF), 2, b
#define PWDF3                            BANKMASK(PORTWDF), 3, b
#define PWDF4                            BANKMASK(PORTWDF), 4, b
#define PWDF5                            BANKMASK(PORTWDF), 5, b
#define PWDF6                            BANKMASK(PORTWDF), 6, b
#define PWDF7                            BANKMASK(PORTWDF), 7, b
#define PWM1ERSPPS0                      BANKMASK(PWM1ERSPPS), 0, b
#define PWM1ERSPPS1                      BANKMASK(PWM1ERSPPS), 1, b
#define PWM1ERSPPS2                      BANKMASK(PWM1ERSPPS), 2, b
#define PWM1ERSPPS3                      BANKMASK(PWM1ERSPPS), 3, b
#define PWM1ERSPPS4                      BANKMASK(PWM1ERSPPS), 4, b
#define PWM1ERSPPS5                      BANKMASK(PWM1ERSPPS), 5, b
#define PWM1IE                           BANKMASK(PIE4), 7, a
#define PWM1IF                           BANKMASK(PIR4), 7, a
#define PWM1IP                           BANKMASK(IPR4), 7, a
#define PWM1MD                           BANKMASK(PMD3), 0, b
#define PWM1PIE                          BANKMASK(PIE4), 6, a
#define PWM1PIF                          BANKMASK(PIR4), 6, a
#define PWM1PIP                          BANKMASK(IPR4), 6, a
#define PWM2ERSPPS0                      BANKMASK(PWM2ERSPPS), 0, b
#define PWM2ERSPPS1                      BANKMASK(PWM2ERSPPS), 1, b
#define PWM2ERSPPS2                      BANKMASK(PWM2ERSPPS), 2, b
#define PWM2ERSPPS3                      BANKMASK(PWM2ERSPPS), 3, b
#define PWM2ERSPPS4                      BANKMASK(PWM2ERSPPS), 4, b
#define PWM2ERSPPS5                      BANKMASK(PWM2ERSPPS), 5, b
#define PWM2IE                           BANKMASK(PIE5), 7, a
#define PWM2IF                           BANKMASK(PIR5), 7, a
#define PWM2IP                           BANKMASK(IPR5), 7, a
#define PWM2MD                           BANKMASK(PMD3), 1, b
#define PWM2PIE                          BANKMASK(PIE5), 6, a
#define PWM2PIF                          BANKMASK(PIR5), 6, a
#define PWM2PIP                          BANKMASK(IPR5), 6, a
#define PWM3ERSPPS0                      BANKMASK(PWM3ERSPPS), 0, b
#define PWM3ERSPPS1                      BANKMASK(PWM3ERSPPS), 1, b
#define PWM3ERSPPS2                      BANKMASK(PWM3ERSPPS), 2, b
#define PWM3ERSPPS3                      BANKMASK(PWM3ERSPPS), 3, b
#define PWM3ERSPPS4                      BANKMASK(PWM3ERSPPS), 4, b
#define PWM3ERSPPS5                      BANKMASK(PWM3ERSPPS), 5, b
#define PWM3IE                           BANKMASK(PIE7), 7, a
#define PWM3IF                           BANKMASK(PIR7), 7, a
#define PWM3IP                           BANKMASK(IPR7), 7, a
#define PWM3MD                           BANKMASK(PMD3), 2, b
#define PWM3PIE                          BANKMASK(PIE7), 6, a
#define PWM3PIF                          BANKMASK(PIR7), 6, a
#define PWM3PIP                          BANKMASK(IPR7), 6, a
#define PWMIN0PPS0                       BANKMASK(PWMIN0PPS), 0, b
#define PWMIN0PPS1                       BANKMASK(PWMIN0PPS), 1, b
#define PWMIN0PPS2                       BANKMASK(PWMIN0PPS), 2, b
#define PWMIN0PPS3                       BANKMASK(PWMIN0PPS), 3, b
#define PWMIN0PPS4                       BANKMASK(PWMIN0PPS), 4, b
#define PWMIN0PPS5                       BANKMASK(PWMIN0PPS), 5, b
#define PWMIN1PPS0                       BANKMASK(PWMIN1PPS), 0, b
#define PWMIN1PPS1                       BANKMASK(PWMIN1PPS), 1, b
#define PWMIN1PPS2                       BANKMASK(PWMIN1PPS), 2, b
#define PWMIN1PPS3                       BANKMASK(PWMIN1PPS), 3, b
#define PWMIN1PPS4                       BANKMASK(PWMIN1PPS), 4, b
#define PWMIN1PPS5                       BANKMASK(PWMIN1PPS), 5, b
#define PWS0                             BANKMASK(NCO1CLK), 5, b
#define PWS1                             BANKMASK(NCO1CLK), 6, b
#define PWS2                             BANKMASK(NCO1CLK), 7, b
#define RA0                              BANKMASK(PORTA), 0, b
#define RA0PPS0                          BANKMASK(RA0PPS), 0, b
#define RA0PPS1                          BANKMASK(RA0PPS), 1, b
#define RA0PPS2                          BANKMASK(RA0PPS), 2, b
#define RA0PPS3                          BANKMASK(RA0PPS), 3, b
#define RA0PPS4                          BANKMASK(RA0PPS), 4, b
#define RA0PPS5                          BANKMASK(RA0PPS), 5, b
#define RA1                              BANKMASK(PORTA), 1, b
#define RA1PPS0                          BANKMASK(RA1PPS), 0, b
#define RA1PPS1                          BANKMASK(RA1PPS), 1, b
#define RA1PPS2                          BANKMASK(RA1PPS), 2, b
#define RA1PPS3                          BANKMASK(RA1PPS), 3, b
#define RA1PPS4                          BANKMASK(RA1PPS), 4, b
#define RA1PPS5                          BANKMASK(RA1PPS), 5, b
#define RA2                              BANKMASK(PORTA), 2, b
#define RA2PPS0                          BANKMASK(RA2PPS), 0, b
#define RA2PPS1                          BANKMASK(RA2PPS), 1, b
#define RA2PPS2                          BANKMASK(RA2PPS), 2, b
#define RA2PPS3                          BANKMASK(RA2PPS), 3, b
#define RA2PPS4                          BANKMASK(RA2PPS), 4, b
#define RA2PPS5                          BANKMASK(RA2PPS), 5, b
#define RA3                              BANKMASK(PORTA), 3, b
#define RA3PPS0                          BANKMASK(RA3PPS), 0, b
#define RA3PPS1                          BANKMASK(RA3PPS), 1, b
#define RA3PPS2                          BANKMASK(RA3PPS), 2, b
#define RA3PPS3                          BANKMASK(RA3PPS), 3, b
#define RA3PPS4                          BANKMASK(RA3PPS), 4, b
#define RA3PPS5                          BANKMASK(RA3PPS), 5, b
#define RA4                              BANKMASK(PORTA), 4, b
#define RA4PPS0                          BANKMASK(RA4PPS), 0, b
#define RA4PPS1                          BANKMASK(RA4PPS), 1, b
#define RA4PPS2                          BANKMASK(RA4PPS), 2, b
#define RA4PPS3                          BANKMASK(RA4PPS), 3, b
#define RA4PPS4                          BANKMASK(RA4PPS), 4, b
#define RA4PPS5                          BANKMASK(RA4PPS), 5, b
#define RA5                              BANKMASK(PORTA), 5, b
#define RA5PPS0                          BANKMASK(RA5PPS), 0, b
#define RA5PPS1                          BANKMASK(RA5PPS), 1, b
#define RA5PPS2                          BANKMASK(RA5PPS), 2, b
#define RA5PPS3                          BANKMASK(RA5PPS), 3, b
#define RA5PPS4                          BANKMASK(RA5PPS), 4, b
#define RA5PPS5                          BANKMASK(RA5PPS), 5, b
#define RA6                              BANKMASK(PORTA), 6, b
#define RA6PPS0                          BANKMASK(RA6PPS), 0, b
#define RA6PPS1                          BANKMASK(RA6PPS), 1, b
#define RA6PPS2                          BANKMASK(RA6PPS), 2, b
#define RA6PPS3                          BANKMASK(RA6PPS), 3, b
#define RA6PPS4                          BANKMASK(RA6PPS), 4, b
#define RA6PPS5                          BANKMASK(RA6PPS), 5, b
#define RA7                              BANKMASK(PORTA), 7, b
#define RA7PPS0                          BANKMASK(RA7PPS), 0, b
#define RA7PPS1                          BANKMASK(RA7PPS), 1, b
#define RA7PPS2                          BANKMASK(RA7PPS), 2, b
#define RA7PPS3                          BANKMASK(RA7PPS), 3, b
#define RA7PPS4                          BANKMASK(RA7PPS), 4, b
#define RA7PPS5                          BANKMASK(RA7PPS), 5, b
#define RB0                              BANKMASK(PORTB), 0, b
#define RB0PPS0                          BANKMASK(RB0PPS), 0, b
#define RB0PPS1                          BANKMASK(RB0PPS), 1, b
#define RB0PPS2                          BANKMASK(RB0PPS), 2, b
#define RB0PPS3                          BANKMASK(RB0PPS), 3, b
#define RB0PPS4                          BANKMASK(RB0PPS), 4, b
#define RB0PPS5                          BANKMASK(RB0PPS), 5, b
#define RB1                              BANKMASK(PORTB), 1, b
#define RB1PPS0                          BANKMASK(RB1PPS), 0, b
#define RB1PPS1                          BANKMASK(RB1PPS), 1, b
#define RB1PPS2                          BANKMASK(RB1PPS), 2, b
#define RB1PPS3                          BANKMASK(RB1PPS), 3, b
#define RB1PPS4                          BANKMASK(RB1PPS), 4, b
#define RB1PPS5                          BANKMASK(RB1PPS), 5, b
#define RB2                              BANKMASK(PORTB), 2, b
#define RB2PPS0                          BANKMASK(RB2PPS), 0, b
#define RB2PPS1                          BANKMASK(RB2PPS), 1, b
#define RB2PPS2                          BANKMASK(RB2PPS), 2, b
#define RB2PPS3                          BANKMASK(RB2PPS), 3, b
#define RB2PPS4                          BANKMASK(RB2PPS), 4, b
#define RB2PPS5                          BANKMASK(RB2PPS), 5, b
#define RB3                              BANKMASK(PORTB), 3, b
#define RB3PPS0                          BANKMASK(RB3PPS), 0, b
#define RB3PPS1                          BANKMASK(RB3PPS), 1, b
#define RB3PPS2                          BANKMASK(RB3PPS), 2, b
#define RB3PPS3                          BANKMASK(RB3PPS), 3, b
#define RB3PPS4                          BANKMASK(RB3PPS), 4, b
#define RB3PPS5                          BANKMASK(RB3PPS), 5, b
#define RB4                              BANKMASK(PORTB), 4, b
#define RB4PPS0                          BANKMASK(RB4PPS), 0, b
#define RB4PPS1                          BANKMASK(RB4PPS), 1, b
#define RB4PPS2                          BANKMASK(RB4PPS), 2, b
#define RB4PPS3                          BANKMASK(RB4PPS), 3, b
#define RB4PPS4                          BANKMASK(RB4PPS), 4, b
#define RB4PPS5                          BANKMASK(RB4PPS), 5, b
#define RB5                              BANKMASK(PORTB), 5, b
#define RB5PPS0                          BANKMASK(RB5PPS), 0, b
#define RB5PPS1                          BANKMASK(RB5PPS), 1, b
#define RB5PPS2                          BANKMASK(RB5PPS), 2, b
#define RB5PPS3                          BANKMASK(RB5PPS), 3, b
#define RB5PPS4                          BANKMASK(RB5PPS), 4, b
#define RB5PPS5                          BANKMASK(RB5PPS), 5, b
#define RB6                              BANKMASK(PORTB), 6, b
#define RB6PPS0                          BANKMASK(RB6PPS), 0, b
#define RB6PPS1                          BANKMASK(RB6PPS), 1, b
#define RB6PPS2                          BANKMASK(RB6PPS), 2, b
#define RB6PPS3                          BANKMASK(RB6PPS), 3, b
#define RB6PPS4                          BANKMASK(RB6PPS), 4, b
